Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/health_services/health_services_for_older_people/nursing_homes_support_scheme_1.html.txt.tmx
Source language: en
Languages: ga

source: The application for appointment must be made to the County Registrar in any county in the Circuit in which the person requiring a Care Representative now lives or in which he/ she has lived at any time during the past three years
ga: Ní mór an t-iarratas ar cheapachán a dhéanamh leis an gCláraitheoir Contae in aon chontae sa Chiorcad ina gcónaíonn an duine óna dteastaíonn Ionadaí Cúraim anois nó inar chónaigh sé/sí ag tráth ar bith le trí bliana anuas

source: You do not need to obtain legal representation in order to be appointed as a Care Representative
ga: Ní gá duit ionadaíocht dhlíthiúil a fháil go gceapfar thú mar Ionadaí Cúraim

source: However, anyone who wishes to seek legal advice/representation is free to do so
ga: Díolúintí leis an gceanglas lena mbaineann ceapachán mar Ionadaí Cúraim

source: For more information on the legal procedure, see Information Booklet on the Nursing Homes Support Scheme (pdf
ga: • Sa chás go bhfuil duine eile ceadaithe ag an dlí chun feidhmiú ar son an iarratasóra
